; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-2-1-3-3-3-6) (:domain depots)
(:objects
	depot0 depot1 - Depot
	distributor0 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - Crate
	hoist0 hoist1 hoist2 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 depot1)
	(clear crate5)
	(at pallet2 distributor0)
	(clear pallet2)
	(at truck0 depot0)
	(at truck1 depot0)
	(at truck2 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 distributor0)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 depot0)
	(on crate1 crate0)
	(at crate2 depot1)
	(on crate2 pallet1)
	(at crate3 depot1)
	(on crate3 crate2)
	(at crate4 depot1)
	(on crate4 crate3)
	(at crate5 depot1)
	(on crate5 crate4)
)

(:goal (and
		(on crate0 crate5)
		(on crate1 pallet2)
		(on crate2 crate4)
		(on crate3 pallet1)
		(on crate4 pallet0)
		(on crate5 crate2)
	)
))

; plan
1. (lift hoist0 crate1 crate0 depot0)
   deleted: (at crate1 depot0) (available hoist0) (on crate1 crate0) (clear crate1)
   added: (lifting hoist0 crate1) (clear crate0)
   goals met: 0 of 6
2. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   goals met: 0 of 6
3. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (available hoist0) (on crate0 pallet0) (clear crate0)
   added: (lifting hoist0 crate0) (clear pallet0)
   goals met: 0 of 6
4. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   goals met: 0 of 6
5. (lift hoist1 crate5 crate4 depot1)
   deleted: (at crate5 depot1) (available hoist1) (on crate5 crate4) (clear crate5)
   added: (lifting hoist1 crate5) (clear crate4)
   goals met: 0 of 6
6. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 0 of 6
7. (load hoist1 crate5 truck1 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   goals met: 0 of 6
8. (lift hoist1 crate4 crate3 depot1)
   deleted: (at crate4 depot1) (available hoist1) (on crate4 crate3) (clear crate4)
   added: (lifting hoist1 crate4) (clear crate3)
   goals met: 0 of 6
9. (load hoist1 crate4 truck1 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   goals met: 0 of 6
10. (lift hoist1 crate3 crate2 depot1)
   deleted: (at crate3 depot1) (available hoist1) (on crate3 crate2) (clear crate3)
   added: (lifting hoist1 crate3) (clear crate2)
   goals met: 0 of 6
11. (load hoist1 crate3 truck1 depot1)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   goals met: 0 of 6
12. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (available hoist1) (on crate2 pallet1) (clear crate2)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 0 of 6
13. (load hoist1 crate2 truck1 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   goals met: 0 of 6
14. (unload hoist1 crate3 truck1 depot1)
   deleted: (available hoist1) (in crate3 truck1)
   added: (lifting hoist1 crate3)
   goals met: 0 of 6
15. (drop hoist1 crate3 pallet1 depot1)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (at crate3 depot1) (available hoist1) (on crate3 pallet1) (clear crate3)
   goals met: 1 of 6
16. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 1 of 6
17. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 1 of 6
18. (unload hoist0 crate4 truck1 depot0)
   deleted: (available hoist0) (in crate4 truck1)
   added: (lifting hoist0 crate4)
   goals met: 1 of 6
19. (drop hoist0 crate4 pallet0 depot0)
   deleted: (lifting hoist0 crate4) (clear pallet0)
   added: (at crate4 depot0) (available hoist0) (on crate4 pallet0) (clear crate4)
   goals met: 2 of 6
20. (unload hoist0 crate2 truck1 depot0)
   deleted: (available hoist0) (in crate2 truck1)
   added: (lifting hoist0 crate2)
   goals met: 2 of 6
21. (drop hoist0 crate2 crate4 depot0)
   deleted: (lifting hoist0 crate2) (clear crate4)
   added: (at crate2 depot0) (available hoist0) (on crate2 crate4) (clear crate2)
   goals met: 3 of 6
22. (unload hoist0 crate5 truck1 depot0)
   deleted: (available hoist0) (in crate5 truck1)
   added: (lifting hoist0 crate5)
   goals met: 3 of 6
23. (drop hoist0 crate5 crate2 depot0)
   deleted: (lifting hoist0 crate5) (clear crate2)
   added: (at crate5 depot0) (available hoist0) (on crate5 crate2) (clear crate5)
   goals met: 4 of 6
24. (unload hoist0 crate0 truck1 depot0)
   deleted: (available hoist0) (in crate0 truck1)
   added: (lifting hoist0 crate0)
   goals met: 4 of 6
25. (drop hoist0 crate0 crate5 depot0)
   deleted: (lifting hoist0 crate0) (clear crate5)
   added: (at crate0 depot0) (available hoist0) (on crate0 crate5) (clear crate0)
   goals met: 5 of 6
26. (unload hoist2 crate1 truck0 distributor0)
   deleted: (available hoist2) (in crate1 truck0)
   added: (lifting hoist2 crate1)
   goals met: 5 of 6
27. (drop hoist2 crate1 pallet2 distributor0)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (at crate1 distributor0) (available hoist2) (on crate1 pallet2) (clear crate1)
   goals met: 6 of 6
